src/Catalogs/рмкТочкиПодключения/рмкТочкиПодключения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>рмкТочкиПодключения</name>
  <attributes>
    <name>Сервер</name>
    <type>
      <types>CatalogRef.рмкСерверы</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяТочки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВиртуальныйХост</name>
    <type>
      <types>CatalogRef.рмкВиртуальныеХосты</types>
    </type>
  </attributes>
  <attributes>
    <name>МенеджерКонвертации</name>
    <type>
      <types>EnumRef.рмкМенеджерыКонвертации</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяМетодаКонвертации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Активна</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяДляРазработчика</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипИнформации</name>
    <type>
      <types>EnumRef.рмкТипыПередаваемойИнформации</types>
    </type>
  </attributes>
  <tabularSections>
    <name>МетаданныеДляРепликации</name>
    <attributes>
      <name>ПолноеИмя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Enums/рмкТипыПередаваемойИнформации/рмкТипыПередаваемойИнформации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>рмкТипыПередаваемойИнформации</name>
  <enumValues>
    <name>Данные</name>
  </enumValues>
  <enumValues>
    <name>Логи</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/рмкТочкиПодключения/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ТипИнформации <> ПредопределенноеЗначение("Перечисление.рмкТипыПередаваемойИнформации.Данные") Тогда
		
		ПроверяемыеРеквизиты.Добавить("ИмяДляРазработчика");
		
	Иначе
			
		ПроверяемыеРеквизиты.Добавить("МенеджерКонвертации");
		ПроверяемыеРеквизиты.Добавить("ИмяМетодаКонвертации");
		ПроверяемыеРеквизиты.Добавить("МетаданныеДляРепликации");	
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка = Истина Тогда
		Возврат;
	КонецЕсли;	
	
	Если ТипИнформации <> ПредопределенноеЗначение("Перечисление.рмкТипыПередаваемойИнформации.Данные") Тогда
		
		МенеджерКонвертации 	= Неопределено;
		ИмяМетодаКонвертации 	= "";
		МетаданныеДляРепликации.Очистить();
		
	КонецЕсли;
		
	Если ТипИнформации <> ПредопределенноеЗначение("Перечисление.рмкТипыПередаваемойИнформации.Логи") Тогда
		ИмяДляРазработчика = "";
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
